{
    "event-app": 
      {
        "title": "Event App",
        "frontendFramework": "React Native",
        "backendLanguage": "Serverless Stack (SST)",

        "summary":"This application is a comprehensive event management system that allows users to register events and manage the attendance of participants. First, users register themselves on the app, and administrators set tiers for users based on their preferences. Once the tier is applied to the users, they can browse events and register for the events they wish to attend. This application includes features such as managing waiting lists and issuing QR codes for events. On the technical side, React Native is used as the frontend framework, and Serverless Stack (sst) is used as the backend. Account management is implemented using Cognito, and an authentication system based on JWT tokens is employed.",
        "thumbnail": "/images/event-app.png",
        "imagePaths": [
          "/images/event-app/signin.png",
          "/images/event-app/eventsupcoming.png",
          "/images/event-app/createevent.png",
          "/images/event-app/calendar.png",
          "/images/event-app/qrcode.png"
        ],
        "githubUrl": "https://github.com/yukobcit/Event-App",
        "deployedUrl": "#"
      },
      
      "food-ordering-app":
      {
        "name": "Foood Ordering App",
        "title": "Food Ordering App",
        "frontendFramework": "HTML",
        "backendLanguage": "C#",
        "summary": "This application is designed to manage pickup orders from a restaurant. First, users have the option to register on the application. In this case, they can customize and place orders for sandwiches. As an additional feature, users can save their favorite sandwiches to easily reorder them. On the admin side, there are functionalities for order aggregation and other analytics. On the technical side, the backend is developed using C#, and Razor View is utilized to display database information. jQuery is used to manipulate and update order details.",
        "thumbnail": "/images/pick-and-go.png",
        "imagePaths": [
          "/images/food-ordering-app/home.png",
          "/images/food-ordering-app/selectmenu.png",
          "/images/food-ordering-app/ordercustomize.png",
          "/images/food-ordering-app/shoppingcart.png",
          "/images/food-ordering-app/paypal.png"
        ],
        "githubUrl": "https://github.com/yukobcit/Pick-And-Go",
        "deployedUrl": "#"
      },
      "game-journal-app":
      {
        "name": "Game Journal App",
        "title": "Game Journal App",
        "frontendFramework": "React",
        "backendLanguage": "Serverless Stack (SST)",
        "summary": "This application allows you to record the progress of your video game journey",
        "imagePaths": [
          "/images/300x400.png"
        ],
        "githubUrl": "https://github.com/yukobcit/game-journey",
        "deployedUrl": "#"
      }
  }
  